Microchip-MPLAB-Harmony/csp/apps/tc/tc_capture_mode/firmware/src/packs/ATSAMV71Q21B_DFP/component/usart.h
/* -------- US_MR : (USART Offset: 0x04) (R/W 32) Mode Register -------- */
#define US_MR_USART_MODE_Pos                  (0U)                                           /**< (US_MR) USART Mode of Operation Position */
#define US_MR_USART_MODE_Msk                  (0xFU << US_MR_USART_MODE_Pos)                 /**< (US_MR) USART Mode of Operation Mask */
#define US_MR_USART_MODE(value)               (US_MR_USART_MODE_Msk & ((value) << US_MR_USART_MODE_Pos))
#define   US_MR_USART_MODE_NORMAL_Val         (0U)                                           /**< (US_MR) Normal mode  */
#define   US_MR_USART_MODE_RS485_Val          (1U)                                           /**< (US_MR) RS485  */
#define   US_MR_USART_MODE_HW_HANDSHAKING_Val (2U)                                           /**< (US_MR) Hardware handshaking  */
#define   US_MR_USART_MODE_MODEM_Val          (3U)                                           /**< (US_MR) Modem  */
#define   US_MR_USART_MODE_IS07816_T_0_Val    (4U)                                           /**< (US_MR) IS07816 Protocol: T = 0  */
#define   US_MR_USART_MODE_IS07816_T_1_Val    (6U)                                           /**< (US_MR) IS07816 Protocol: T = 1  */
#define   US_MR_USART_MODE_IRDA_Val           (8U)                                           /**< (US_MR) IrDA  */
#define   US_MR_USART_MODE_LON_Val            (9U)                                           /**< (US_MR) LON  */
#define   US_MR_USART_MODE_LIN_MASTER_Val     (10U)                                          /**< (US_MR) LIN Master mode  */
#define   US_MR_USART_MODE_LIN_SLAVE_Val      (11U)                                          /**< (US_MR) LIN Slave mode  */
#define   US_MR_USART_MODE_SPI_MASTER_Val     (14U)                                          /**< (US_MR) SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)  */
#define   US_MR_USART_MODE_SPI_SLAVE_Val      (15U)                                          /**< (US_MR) SPI Slave mode  */
#define US_MR_USART_MODE_NORMAL               (US_MR_USART_MODE_NORMAL_Val << US_MR_USART_MODE_Pos) /**< (US_MR) Normal mode Position  */
#define US_MR_USART_MODE_RS485                (US_MR_USART_MODE_RS485_Val << US_MR_USART_MODE_Pos) /**< (US_MR) RS485 Position  */
#define US_MR_USART_MODE_HW_HANDSHAKING       (US_MR_USART_MODE_HW_HANDSHAKING_Val << US_MR_USART_MODE_Pos) /**< (US_MR) Hardware handshaking Position  */
#define US_MR_USART_MODE_MODEM                (US_MR_USART_MODE_MODEM_Val << US_MR_USART_MODE_Pos) /**< (US_MR) Modem Position  */
#define US_MR_USART_MODE_IS07816_T_0          (US_MR_USART_MODE_IS07816_T_0_Val << US_MR_USART_MODE_Pos) /**< (US_MR) IS07816 Protocol: T = 0 Position  */
#define US_MR_USART_MODE_IS07816_T_1          (US_MR_USART_MODE_IS07816_T_1_Val << US_MR_USART_MODE_Pos) /**< (US_MR) IS07816 Protocol: T = 1 Position  */
#define US_MR_USART_MODE_IRDA                 (US_MR_USART_MODE_IRDA_Val << US_MR_USART_MODE_Pos) /**< (US_MR) IrDA Position  */
#define US_MR_USART_MODE_LON                  (US_MR_USART_MODE_LON_Val << US_MR_USART_MODE_Pos) /**< (US_MR) LON Position  */
#define US_MR_USART_MODE_LIN_MASTER           (US_MR_USART_MODE_LIN_MASTER_Val << US_MR_USART_MODE_Pos) /**< (US_MR) LIN Master mode Position  */
#define US_MR_USART_MODE_LIN_SLAVE            (US_MR_USART_MODE_LIN_SLAVE_Val << US_MR_USART_MODE_Pos) /**< (US_MR) LIN Slave mode Position  */
#define US_MR_USART_MODE_SPI_MASTER           (US_MR_USART_MODE_SPI_MASTER_Val << US_MR_USART_MODE_Pos) /**< (US_MR) SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2) Position  */
#define US_MR_USART_MODE_SPI_SLAVE            (US_MR_USART_MODE_SPI_SLAVE_Val << US_MR_USART_MODE_Pos) /**< (US_MR) SPI Slave mode Position  */
#define US_MR_USCLKS_Pos                      (4U)                                           /**< (US_MR) Clock Selection Position */
#define US_MR_USCLKS_Msk                      (0x3U << US_MR_USCLKS_Pos)                     /**< (US_MR) Clock Selection Mask */
#define US_MR_USCLKS(value)                   (US_MR_USCLKS_Msk & ((value) << US_MR_USCLKS_Pos))
#define   US_MR_USCLKS_MCK_Val                (0U)                                           /**< (US_MR) Peripheral clock is selected  */
#define   US_MR_USCLKS_DIV_Val                (1U)                                           /**< (US_MR) Peripheral clock divided (DIV = 8) is selected  */
#define   US_MR_USCLKS_PCK_Val                (2U)                                           /**< (US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1.  */
#define   US_MR_USCLKS_SCK_Val                (3U)                                           /**< (US_MR) Serial clock (SCK) is selected  */
#define US_MR_USCLKS_MCK                      (US_MR_USCLKS_MCK_Val << US_MR_USCLKS_Pos)     /**< (US_MR) Peripheral clock is selected Position  */
#define US_MR_USCLKS_DIV                      (US_MR_USCLKS_DIV_Val << US_MR_USCLKS_Pos)     /**< (US_MR) Peripheral clock divided (DIV = 8) is selected Position  */
#define US_MR_USCLKS_PCK                      (US_MR_USCLKS_PCK_Val << US_MR_USCLKS_Pos)     /**< (US_MR) PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1. Position  */
#define US_MR_USCLKS_SCK                      (US_MR_USCLKS_SCK_Val << US_MR_USCLKS_Pos)     /**< (US_MR) Serial clock (SCK) is selected Position  */
#define US_MR_CHRL_Pos                        (6U)                                           /**< (US_MR) Character Length Position */
#define US_MR_CHRL_Msk                        (0x3U << US_MR_CHRL_Pos)                       /**< (US_MR) Character Length Mask */
#define US_MR_CHRL(value)                     (US_MR_CHRL_Msk & ((value) << US_MR_CHRL_Pos))
#define   US_MR_CHRL_5_BIT_Val                (0U)                                           /**< (US_MR) Character length is 5 bits  */
#define   US_MR_CHRL_6_BIT_Val                (1U)                                           /**< (US_MR) Character length is 6 bits  */
#define   US_MR_CHRL_7_BIT_Val                (2U)                                           /**< (US_MR) Character length is 7 bits  */
#define   US_MR_CHRL_8_BIT_Val                (3U)                                           /**< (US_MR) Character length is 8 bits  */
#define US_MR_CHRL_5_BIT                      (US_MR_CHRL_5_BIT_Val << US_MR_CHRL_Pos)       /**< (US_MR) Character length is 5 bits Position  */
#define US_MR_CHRL_6_BIT                      (US_MR_CHRL_6_BIT_Val << US_MR_CHRL_Pos)       /**< (US_MR) Character length is 6 bits Position  */
#define US_MR_CHRL_7_BIT                      (US_MR_CHRL_7_BIT_Val << US_MR_CHRL_Pos)       /**< (US_MR) Character length is 7 bits Position  */
#define US_MR_CHRL_8_BIT                      (US_MR_CHRL_8_BIT_Val << US_MR_CHRL_Pos)       /**< (US_MR) Character length is 8 bits Position  */
#define US_MR_SYNC_Pos                        (8U)                                           /**< (US_MR) Synchronous Mode Select Position */
#define US_MR_SYNC_Msk                        (0x1U << US_MR_SYNC_Pos)                       /**< (US_MR) Synchronous Mode Select Mask */
#define US_MR_SYNC(value)                     (US_MR_SYNC_Msk & ((value) << US_MR_SYNC_Pos))
#define US_MR_PAR_Pos                         (9U)                                           /**< (US_MR) Parity Type Position */
#define US_MR_PAR_Msk                         (0x7U << US_MR_PAR_Pos)                        /**< (US_MR) Parity Type Mask */
#define US_MR_PAR(value)                      (US_MR_PAR_Msk & ((value) << US_MR_PAR_Pos))  
#define   US_MR_PAR_EVEN_Val                  (0U)                                           /**< (US_MR) Even parity  */
#define   US_MR_PAR_ODD_Val                   (1U)                                           /**< (US_MR) Odd parity  */
#define   US_MR_PAR_SPACE_Val                 (2U)                                           /**< (US_MR) Parity forced to 0 (Space)  */
#define   US_MR_PAR_MARK_Val                  (3U)                                           /**< (US_MR) Parity forced to 1 (Mark)  */
#define   US_MR_PAR_NO_Val                    (4U)                                           /**< (US_MR) No parity  */
#define   US_MR_PAR_MULTIDROP_Val             (6U)                                           /**< (US_MR) Multidrop mode  */
#define US_MR_PAR_EVEN                        (US_MR_PAR_EVEN_Val << US_MR_PAR_Pos)          /**< (US_MR) Even parity Position  */
#define US_MR_PAR_ODD                         (US_MR_PAR_ODD_Val << US_MR_PAR_Pos)           /**< (US_MR) Odd parity Position  */
#define US_MR_PAR_SPACE                       (US_MR_PAR_SPACE_Val << US_MR_PAR_Pos)         /**< (US_MR) Parity forced to 0 (Space) Position  */
#define US_MR_PAR_MARK                        (US_MR_PAR_MARK_Val << US_MR_PAR_Pos)          /**< (US_MR) Parity forced to 1 (Mark) Position  */
#define US_MR_PAR_NO                          (US_MR_PAR_NO_Val << US_MR_PAR_Pos)            /**< (US_MR) No parity Position  */
#define US_MR_PAR_MULTIDROP                   (US_MR_PAR_MULTIDROP_Val << US_MR_PAR_Pos)     /**< (US_MR) Multidrop mode Position  */
#define US_MR_NBSTOP_Pos                      (12U)                                          /**< (US_MR) Number of Stop Bits Position */
#define US_MR_NBSTOP_Msk                      (0x3U << US_MR_NBSTOP_Pos)                     /**< (US_MR) Number of Stop Bits Mask */
#define US_MR_NBSTOP(value)                   (US_MR_NBSTOP_Msk & ((value) << US_MR_NBSTOP_Pos))
#define   US_MR_NBSTOP_1_BIT_Val              (0U)                                           /**< (US_MR) 1 stop bit  */
#define   US_MR_NBSTOP_1_5_BIT_Val            (1U)                                           /**< (US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)  */
#define   US_MR_NBSTOP_2_BIT_Val              (2U)                                           /**< (US_MR) 2 stop bits  */
#define US_MR_NBSTOP_1_BIT                    (US_MR_NBSTOP_1_BIT_Val << US_MR_NBSTOP_Pos)   /**< (US_MR) 1 stop bit Position  */
#define US_MR_NBSTOP_1_5_BIT                  (US_MR_NBSTOP_1_5_BIT_Val << US_MR_NBSTOP_Pos) /**< (US_MR) 1.5 stop bit (SYNC = 0) or reserved (SYNC = 1) Position  */
#define US_MR_NBSTOP_2_BIT                    (US_MR_NBSTOP_2_BIT_Val << US_MR_NBSTOP_Pos)   /**< (US_MR) 2 stop bits Position  */
#define US_MR_CHMODE_Pos                      (14U)                                          /**< (US_MR) Channel Mode Position */
#define US_MR_CHMODE_Msk                      (0x3U << US_MR_CHMODE_Pos)                     /**< (US_MR) Channel Mode Mask */
#define US_MR_CHMODE(value)                   (US_MR_CHMODE_Msk & ((value) << US_MR_CHMODE_Pos))
#define   US_MR_CHMODE_NORMAL_Val             (0U)                                           /**< (US_MR) Normal mode  */
#define   US_MR_CHMODE_AUTOMATIC_Val          (1U)                                           /**< (US_MR) Automatic Echo. Receiver input is connected to the TXD pin.  */
#define   US_MR_CHMODE_LOCAL_LOOPBACK_Val     (2U)                                           /**< (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input.  */
#define   US_MR_CHMODE_REMOTE_LOOPBACK_Val    (3U)                                           /**< (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin.  */
#define US_MR_CHMODE_NORMAL                   (US_MR_CHMODE_NORMAL_Val << US_MR_CHMODE_Pos)  /**< (US_MR) Normal mode Position  */
#define US_MR_CHMODE_AUTOMATIC                (US_MR_CHMODE_AUTOMATIC_Val << US_MR_CHMODE_Pos) /**< (US_MR) Automatic Echo. Receiver input is connected to the TXD pin. Position  */
#define US_MR_CHMODE_LOCAL_LOOPBACK           (US_MR_CHMODE_LOCAL_LOOPBACK_Val << US_MR_CHMODE_Pos) /**< (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input. Position  */
#define US_MR_CHMODE_REMOTE_LOOPBACK          (US_MR_CHMODE_REMOTE_LOOPBACK_Val << US_MR_CHMODE_Pos) /**< (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin. Position  */
#define US_MR_MSBF_Pos                        (16U)                                          /**< (US_MR) Bit Order Position */
#define US_MR_MSBF_Msk                        (0x1U << US_MR_MSBF_Pos)                       /**< (US_MR) Bit Order Mask */
#define US_MR_MSBF(value)                     (US_MR_MSBF_Msk & ((value) << US_MR_MSBF_Pos))
#define US_MR_MODE9_Pos                       (17U)                                          /**< (US_MR) 9-bit Character Length Position */
#define US_MR_MODE9_Msk                       (0x1U << US_MR_MODE9_Pos)                      /**< (US_MR) 9-bit Character Length Mask */
#define US_MR_MODE9(value)                    (US_MR_MODE9_Msk & ((value) << US_MR_MODE9_Pos))
#define US_MR_CLKO_Pos                        (18U)                                          /**< (US_MR) Clock Output Select Position */
#define US_MR_CLKO_Msk                        (0x1U << US_MR_CLKO_Pos)                       /**< (US_MR) Clock Output Select Mask */
#define US_MR_CLKO(value)                     (US_MR_CLKO_Msk & ((value) << US_MR_CLKO_Pos))
#define US_MR_OVER_Pos                        (19U)                                          /**< (US_MR) Oversampling Mode Position */
#define US_MR_OVER_Msk                        (0x1U << US_MR_OVER_Pos)                       /**< (US_MR) Oversampling Mode Mask */
#define US_MR_OVER(value)                     (US_MR_OVER_Msk & ((value) << US_MR_OVER_Pos))
#define US_MR_INACK_Pos                       (20U)                                          /**< (US_MR) Inhibit Non Acknowledge Position */
#define US_MR_INACK_Msk                       (0x1U << US_MR_INACK_Pos)                      /**< (US_MR) Inhibit Non Acknowledge Mask */
#define US_MR_INACK(value)                    (US_MR_INACK_Msk & ((value) << US_MR_INACK_Pos))
#define US_MR_DSNACK_Pos                      (21U)                                          /**< (US_MR) Disable Successive NACK Position */
#define US_MR_DSNACK_Msk                      (0x1U << US_MR_DSNACK_Pos)                     /**< (US_MR) Disable Successive NACK Mask */
#define US_MR_DSNACK(value)                   (US_MR_DSNACK_Msk & ((value) << US_MR_DSNACK_Pos))
#define US_MR_VAR_SYNC_Pos                    (22U)                                          /**< (US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter Position */
#define US_MR_VAR_SYNC_Msk                    (0x1U << US_MR_VAR_SYNC_Pos)                   /**< (US_MR) Variable Synchronization of Command/Data Sync Start Frame Delimiter Mask */
#define US_MR_VAR_SYNC(value)                 (US_MR_VAR_SYNC_Msk & ((value) << US_MR_VAR_SYNC_Pos))
#define US_MR_INVDATA_Pos                     (23U)                                          /**< (US_MR) Inverted Data Position */
#define US_MR_INVDATA_Msk                     (0x1U << US_MR_INVDATA_Pos)                    /**< (US_MR) Inverted Data Mask */
#define US_MR_INVDATA(value)                  (US_MR_INVDATA_Msk & ((value) << US_MR_INVDATA_Pos))
#define US_MR_MAX_ITERATION_Pos               (24U)                                          /**< (US_MR) Maximum Number of Automatic Iteration Position */
#define US_MR_MAX_ITERATION_Msk               (0x7U << US_MR_MAX_ITERATION_Pos)              /**< (US_MR) Maximum Number of Automatic Iteration Mask */
#define US_MR_MAX_ITERATION(value)            (US_MR_MAX_ITERATION_Msk & ((value) << US_MR_MAX_ITERATION_Pos))
#define US_MR_FILTER_Pos                      (28U)                                          /**< (US_MR) Receive Line Filter Position */
#define US_MR_FILTER_Msk                      (0x1U << US_MR_FILTER_Pos)                     /**< (US_MR) Receive Line Filter Mask */
#define US_MR_FILTER(value)                   (US_MR_FILTER_Msk & ((value) << US_MR_FILTER_Pos))
#define US_MR_MAN_Pos                         (29U)                                          /**< (US_MR) Manchester Encoder/Decoder Enable Position */
#define US_MR_MAN_Msk                         (0x1U << US_MR_MAN_Pos)                        /**< (US_MR) Manchester Encoder/Decoder Enable Mask */
#define US_MR_MAN(value)                      (US_MR_MAN_Msk & ((value) << US_MR_MAN_Pos))  
#define US_MR_MODSYNC_Pos                     (30U)                                          /**< (US_MR) Manchester Synchronization Mode Position */
#define US_MR_MODSYNC_Msk                     (0x1U << US_MR_MODSYNC_Pos)                    /**< (US_MR) Manchester Synchronization Mode Mask */
#define US_MR_MODSYNC(value)                  (US_MR_MODSYNC_Msk & ((value) << US_MR_MODSYNC_Pos))
#define US_MR_ONEBIT_Pos                      (31U)                                          /**< (US_MR) Start Frame Delimiter Selector Position */
#define US_MR_ONEBIT_Msk                      (0x1U << US_MR_ONEBIT_Pos)                     /**< (US_MR) Start Frame Delimiter Selector Mask */
#define US_MR_ONEBIT(value)                   (US_MR_ONEBIT_Msk & ((value) << US_MR_ONEBIT_Pos))
#define US_MR_CPHA_Pos                        (8U)                                           /**< (US_MR) SPI Clock Phase Position */
#define US_MR_CPHA_Msk                        (0x1U << US_MR_CPHA_Pos)                       /**< (US_MR) SPI Clock Phase Mask */
#define US_MR_CPHA(value)                     (US_MR_CPHA_Msk & ((value) << US_MR_CPHA_Pos))
#define US_MR_CPOL_Pos                        (16U)                                          /**< (US_MR) SPI Clock Polarity Position */
#define US_MR_CPOL_Msk                        (0x1U << US_MR_CPOL_Pos)                       /**< (US_MR) SPI Clock Polarity Mask */
#define US_MR_CPOL(value)                     (US_MR_CPOL_Msk & ((value) << US_MR_CPOL_Pos))
#define US_MR_WRDBT_Pos                       (20U)                                          /**< (US_MR) Wait Read Data Before Transfer Position */
#define US_MR_WRDBT_Msk                       (0x1U << US_MR_WRDBT_Pos)                      /**< (US_MR) Wait Read Data Before Transfer Mask */
#define US_MR_WRDBT(value)                    (US_MR_WRDBT_Msk & ((value) << US_MR_WRDBT_Pos))
#define US_MR_Msk                             (0xF7FFFFFFUL)                                 /**< (US_MR) Register Mask  */

