Microchip-MPLAB-Harmony/csp/apps/tc/tc_capture_mode/firmware/src/packs/ATSAMV71Q21B_DFP/component/usart.h
/* -------- US_IER : (USART Offset: 0x08) ( /W 32) Interrupt Enable Register -------- */
#define US_IER_RXRDY_Pos                      (0U)                                           /**< (US_IER) RXRDY Interrupt Enable Position */
#define US_IER_RXRDY_Msk                      (0x1U << US_IER_RXRDY_Pos)                     /**< (US_IER) RXRDY Interrupt Enable Mask */
#define US_IER_RXRDY(value)                   (US_IER_RXRDY_Msk & ((value) << US_IER_RXRDY_Pos))
#define US_IER_TXRDY_Pos                      (1U)                                           /**< (US_IER) TXRDY Interrupt Enable Position */
#define US_IER_TXRDY_Msk                      (0x1U << US_IER_TXRDY_Pos)                     /**< (US_IER) TXRDY Interrupt Enable Mask */
#define US_IER_TXRDY(value)                   (US_IER_TXRDY_Msk & ((value) << US_IER_TXRDY_Pos))
#define US_IER_RXBRK_Pos                      (2U)                                           /**< (US_IER) Receiver Break Interrupt Enable Position */
#define US_IER_RXBRK_Msk                      (0x1U << US_IER_RXBRK_Pos)                     /**< (US_IER) Receiver Break Interrupt Enable Mask */
#define US_IER_RXBRK(value)                   (US_IER_RXBRK_Msk & ((value) << US_IER_RXBRK_Pos))
#define US_IER_OVRE_Pos                       (5U)                                           /**< (US_IER) Overrun Error Interrupt Enable Position */
#define US_IER_OVRE_Msk                       (0x1U << US_IER_OVRE_Pos)                      /**< (US_IER) Overrun Error Interrupt Enable Mask */
#define US_IER_OVRE(value)                    (US_IER_OVRE_Msk & ((value) << US_IER_OVRE_Pos))
#define US_IER_FRAME_Pos                      (6U)                                           /**< (US_IER) Framing Error Interrupt Enable Position */
#define US_IER_FRAME_Msk                      (0x1U << US_IER_FRAME_Pos)                     /**< (US_IER) Framing Error Interrupt Enable Mask */
#define US_IER_FRAME(value)                   (US_IER_FRAME_Msk & ((value) << US_IER_FRAME_Pos))
#define US_IER_PARE_Pos                       (7U)                                           /**< (US_IER) Parity Error Interrupt Enable Position */
#define US_IER_PARE_Msk                       (0x1U << US_IER_PARE_Pos)                      /**< (US_IER) Parity Error Interrupt Enable Mask */
#define US_IER_PARE(value)                    (US_IER_PARE_Msk & ((value) << US_IER_PARE_Pos))
#define US_IER_TIMEOUT_Pos                    (8U)                                           /**< (US_IER) Timeout Interrupt Enable Position */
#define US_IER_TIMEOUT_Msk                    (0x1U << US_IER_TIMEOUT_Pos)                   /**< (US_IER) Timeout Interrupt Enable Mask */
#define US_IER_TIMEOUT(value)                 (US_IER_TIMEOUT_Msk & ((value) << US_IER_TIMEOUT_Pos))
#define US_IER_TXEMPTY_Pos                    (9U)                                           /**< (US_IER) TXEMPTY Interrupt Enable Position */
#define US_IER_TXEMPTY_Msk                    (0x1U << US_IER_TXEMPTY_Pos)                   /**< (US_IER) TXEMPTY Interrupt Enable Mask */
#define US_IER_TXEMPTY(value)                 (US_IER_TXEMPTY_Msk & ((value) << US_IER_TXEMPTY_Pos))
#define US_IER_ITER_Pos                       (10U)                                          /**< (US_IER) Max number of Repetitions Reached Interrupt Enable Position */
#define US_IER_ITER_Msk                       (0x1U << US_IER_ITER_Pos)                      /**< (US_IER) Max number of Repetitions Reached Interrupt Enable Mask */
#define US_IER_ITER(value)                    (US_IER_ITER_Msk & ((value) << US_IER_ITER_Pos))
#define US_IER_NACK_Pos                       (13U)                                          /**< (US_IER) Non Acknowledge Interrupt Enable Position */
#define US_IER_NACK_Msk                       (0x1U << US_IER_NACK_Pos)                      /**< (US_IER) Non Acknowledge Interrupt Enable Mask */
#define US_IER_NACK(value)                    (US_IER_NACK_Msk & ((value) << US_IER_NACK_Pos))
#define US_IER_RIIC_Pos                       (16U)                                          /**< (US_IER) Ring Indicator Input Change Enable Position */
#define US_IER_RIIC_Msk                       (0x1U << US_IER_RIIC_Pos)                      /**< (US_IER) Ring Indicator Input Change Enable Mask */
#define US_IER_RIIC(value)                    (US_IER_RIIC_Msk & ((value) << US_IER_RIIC_Pos))
#define US_IER_DSRIC_Pos                      (17U)                                          /**< (US_IER) Data Set Ready Input Change Enable Position */
#define US_IER_DSRIC_Msk                      (0x1U << US_IER_DSRIC_Pos)                     /**< (US_IER) Data Set Ready Input Change Enable Mask */
#define US_IER_DSRIC(value)                   (US_IER_DSRIC_Msk & ((value) << US_IER_DSRIC_Pos))
#define US_IER_DCDIC_Pos                      (18U)                                          /**< (US_IER) Data Carrier Detect Input Change Interrupt Enable Position */
#define US_IER_DCDIC_Msk                      (0x1U << US_IER_DCDIC_Pos)                     /**< (US_IER) Data Carrier Detect Input Change Interrupt Enable Mask */
#define US_IER_DCDIC(value)                   (US_IER_DCDIC_Msk & ((value) << US_IER_DCDIC_Pos))
#define US_IER_CTSIC_Pos                      (19U)                                          /**< (US_IER) Clear to Send Input Change Interrupt Enable Position */
#define US_IER_CTSIC_Msk                      (0x1U << US_IER_CTSIC_Pos)                     /**< (US_IER) Clear to Send Input Change Interrupt Enable Mask */
#define US_IER_CTSIC(value)                   (US_IER_CTSIC_Msk & ((value) << US_IER_CTSIC_Pos))
#define US_IER_MANE_Pos                       (24U)                                          /**< (US_IER) Manchester Error Interrupt Enable Position */
#define US_IER_MANE_Msk                       (0x1U << US_IER_MANE_Pos)                      /**< (US_IER) Manchester Error Interrupt Enable Mask */
#define US_IER_MANE(value)                    (US_IER_MANE_Msk & ((value) << US_IER_MANE_Pos))
#define US_IER_UNRE_Pos                       (10U)                                          /**< (US_IER) Underrun Error Interrupt Enable Position */
#define US_IER_UNRE_Msk                       (0x1U << US_IER_UNRE_Pos)                      /**< (US_IER) Underrun Error Interrupt Enable Mask */
#define US_IER_UNRE(value)                    (US_IER_UNRE_Msk & ((value) << US_IER_UNRE_Pos))
#define US_IER_NSSE_Pos                       (19U)                                          /**< (US_IER) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_IER_NSSE_Msk                       (0x1U << US_IER_NSSE_Pos)                      /**< (US_IER) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
#define US_IER_NSSE(value)                    (US_IER_NSSE_Msk & ((value) << US_IER_NSSE_Pos))
#define US_IER_LINBK_Pos                      (13U)                                          /**< (US_IER) LIN Break Sent or LIN Break Received Interrupt Enable Position */
#define US_IER_LINBK_Msk                      (0x1U << US_IER_LINBK_Pos)                     /**< (US_IER) LIN Break Sent or LIN Break Received Interrupt Enable Mask */
#define US_IER_LINBK(value)                   (US_IER_LINBK_Msk & ((value) << US_IER_LINBK_Pos))
#define US_IER_LINID_Pos                      (14U)                                          /**< (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable Position */
#define US_IER_LINID_Msk                      (0x1U << US_IER_LINID_Pos)                     /**< (US_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable Mask */
#define US_IER_LINID(value)                   (US_IER_LINID_Msk & ((value) << US_IER_LINID_Pos))
#define US_IER_LINTC_Pos                      (15U)                                          /**< (US_IER) LIN Transfer Completed Interrupt Enable Position */
#define US_IER_LINTC_Msk                      (0x1U << US_IER_LINTC_Pos)                     /**< (US_IER) LIN Transfer Completed Interrupt Enable Mask */
#define US_IER_LINTC(value)                   (US_IER_LINTC_Msk & ((value) << US_IER_LINTC_Pos))
#define US_IER_LINBE_Pos                      (25U)                                          /**< (US_IER) LIN Bus Error Interrupt Enable Position */
#define US_IER_LINBE_Msk                      (0x1U << US_IER_LINBE_Pos)                     /**< (US_IER) LIN Bus Error Interrupt Enable Mask */
#define US_IER_LINBE(value)                   (US_IER_LINBE_Msk & ((value) << US_IER_LINBE_Pos))
#define US_IER_LINISFE_Pos                    (26U)                                          /**< (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable Position */
#define US_IER_LINISFE_Msk                    (0x1U << US_IER_LINISFE_Pos)                   /**< (US_IER) LIN Inconsistent Synch Field Error Interrupt Enable Mask */
#define US_IER_LINISFE(value)                 (US_IER_LINISFE_Msk & ((value) << US_IER_LINISFE_Pos))
#define US_IER_LINIPE_Pos                     (27U)                                          /**< (US_IER) LIN Identifier Parity Interrupt Enable Position */
#define US_IER_LINIPE_Msk                     (0x1U << US_IER_LINIPE_Pos)                    /**< (US_IER) LIN Identifier Parity Interrupt Enable Mask */
#define US_IER_LINIPE(value)                  (US_IER_LINIPE_Msk & ((value) << US_IER_LINIPE_Pos))
#define US_IER_LINCE_Pos                      (28U)                                          /**< (US_IER) LIN Checksum Error Interrupt Enable Position */
#define US_IER_LINCE_Msk                      (0x1U << US_IER_LINCE_Pos)                     /**< (US_IER) LIN Checksum Error Interrupt Enable Mask */
#define US_IER_LINCE(value)                   (US_IER_LINCE_Msk & ((value) << US_IER_LINCE_Pos))
#define US_IER_LINSNRE_Pos                    (29U)                                          /**< (US_IER) LIN Slave Not Responding Error Interrupt Enable Position */
#define US_IER_LINSNRE_Msk                    (0x1U << US_IER_LINSNRE_Pos)                   /**< (US_IER) LIN Slave Not Responding Error Interrupt Enable Mask */
#define US_IER_LINSNRE(value)                 (US_IER_LINSNRE_Msk & ((value) << US_IER_LINSNRE_Pos))
#define US_IER_LINSTE_Pos                     (30U)                                          /**< (US_IER) LIN Synch Tolerance Error Interrupt Enable Position */
#define US_IER_LINSTE_Msk                     (0x1U << US_IER_LINSTE_Pos)                    /**< (US_IER) LIN Synch Tolerance Error Interrupt Enable Mask */
#define US_IER_LINSTE(value)                  (US_IER_LINSTE_Msk & ((value) << US_IER_LINSTE_Pos))
#define US_IER_LINHTE_Pos                     (31U)                                          /**< (US_IER) LIN Header Timeout Error Interrupt Enable Position */
#define US_IER_LINHTE_Msk                     (0x1U << US_IER_LINHTE_Pos)                    /**< (US_IER) LIN Header Timeout Error Interrupt Enable Mask */
#define US_IER_LINHTE(value)                  (US_IER_LINHTE_Msk & ((value) << US_IER_LINHTE_Pos))
#define US_IER_LSFE_Pos                       (6U)                                           /**< (US_IER) LON Short Frame Error Interrupt Enable Position */
#define US_IER_LSFE_Msk                       (0x1U << US_IER_LSFE_Pos)                      /**< (US_IER) LON Short Frame Error Interrupt Enable Mask */
#define US_IER_LSFE(value)                    (US_IER_LSFE_Msk & ((value) << US_IER_LSFE_Pos))
#define US_IER_LCRCE_Pos                      (7U)                                           /**< (US_IER) LON CRC Error Interrupt Enable Position */
#define US_IER_LCRCE_Msk                      (0x1U << US_IER_LCRCE_Pos)                     /**< (US_IER) LON CRC Error Interrupt Enable Mask */
#define US_IER_LCRCE(value)                   (US_IER_LCRCE_Msk & ((value) << US_IER_LCRCE_Pos))
#define US_IER_LTXD_Pos                       (24U)                                          /**< (US_IER) LON Transmission Done Interrupt Enable Position */
#define US_IER_LTXD_Msk                       (0x1U << US_IER_LTXD_Pos)                      /**< (US_IER) LON Transmission Done Interrupt Enable Mask */
#define US_IER_LTXD(value)                    (US_IER_LTXD_Msk & ((value) << US_IER_LTXD_Pos))
#define US_IER_LCOL_Pos                       (25U)                                          /**< (US_IER) LON Collision Interrupt Enable Position */
#define US_IER_LCOL_Msk                       (0x1U << US_IER_LCOL_Pos)                      /**< (US_IER) LON Collision Interrupt Enable Mask */
#define US_IER_LCOL(value)                    (US_IER_LCOL_Msk & ((value) << US_IER_LCOL_Pos))
#define US_IER_LFET_Pos                       (26U)                                          /**< (US_IER) LON Frame Early Termination Interrupt Enable Position */
#define US_IER_LFET_Msk                       (0x1U << US_IER_LFET_Pos)                      /**< (US_IER) LON Frame Early Termination Interrupt Enable Mask */
#define US_IER_LFET(value)                    (US_IER_LFET_Msk & ((value) << US_IER_LFET_Pos))
#define US_IER_LRXD_Pos                       (27U)                                          /**< (US_IER) LON Reception Done Interrupt Enable Position */
#define US_IER_LRXD_Msk                       (0x1U << US_IER_LRXD_Pos)                      /**< (US_IER) LON Reception Done Interrupt Enable Mask */
#define US_IER_LRXD(value)                    (US_IER_LRXD_Msk & ((value) << US_IER_LRXD_Pos))
#define US_IER_LBLOVFE_Pos                    (28U)                                          /**< (US_IER) LON Backlog Overflow Error Interrupt Enable Position */
#define US_IER_LBLOVFE_Msk                    (0x1U << US_IER_LBLOVFE_Pos)                   /**< (US_IER) LON Backlog Overflow Error Interrupt Enable Mask */
#define US_IER_LBLOVFE(value)                 (US_IER_LBLOVFE_Msk & ((value) << US_IER_LBLOVFE_Pos))
#define US_IER_Msk                            (0xFF0FE7E7UL)                                 /**< (US_IER) Register Mask  */

