Microchip-MPLAB-Harmony/csp/apps/tc/tc_capture_mode/firmware/src/packs/ATSAMV71Q21B_DFP/component/usart.h
/* -------- US_CSR : (USART Offset: 0x14) (R/  32) Channel Status Register -------- */
#define US_CSR_RXRDY_Pos                      (0U)                                           /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Position */
#define US_CSR_RXRDY_Msk                      (0x1U << US_CSR_RXRDY_Pos)                     /**< (US_CSR) Receiver Ready (cleared by reading US_RHR) Mask */
#define US_CSR_RXRDY(value)                   (US_CSR_RXRDY_Msk & ((value) << US_CSR_RXRDY_Pos))
#define US_CSR_TXRDY_Pos                      (1U)                                           /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Position */
#define US_CSR_TXRDY_Msk                      (0x1U << US_CSR_TXRDY_Pos)                     /**< (US_CSR) Transmitter Ready (cleared by writing US_THR) Mask */
#define US_CSR_TXRDY(value)                   (US_CSR_TXRDY_Msk & ((value) << US_CSR_TXRDY_Pos))
#define US_CSR_RXBRK_Pos                      (2U)                                           /**< (US_CSR) Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_RXBRK_Msk                      (0x1U << US_CSR_RXBRK_Pos)                     /**< (US_CSR) Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_RXBRK(value)                   (US_CSR_RXBRK_Msk & ((value) << US_CSR_RXBRK_Pos))
#define US_CSR_OVRE_Pos                       (5U)                                           /**< (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_OVRE_Msk                       (0x1U << US_CSR_OVRE_Pos)                      /**< (US_CSR) Overrun Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_OVRE(value)                    (US_CSR_OVRE_Msk & ((value) << US_CSR_OVRE_Pos))
#define US_CSR_FRAME_Pos                      (6U)                                           /**< (US_CSR) Framing Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_FRAME_Msk                      (0x1U << US_CSR_FRAME_Pos)                     /**< (US_CSR) Framing Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_FRAME(value)                   (US_CSR_FRAME_Msk & ((value) << US_CSR_FRAME_Pos))
#define US_CSR_PARE_Pos                       (7U)                                           /**< (US_CSR) Parity Error (cleared by writing a one to bit US_CR.RSTSTA) Position */
#define US_CSR_PARE_Msk                       (0x1U << US_CSR_PARE_Pos)                      /**< (US_CSR) Parity Error (cleared by writing a one to bit US_CR.RSTSTA) Mask */
#define US_CSR_PARE(value)                    (US_CSR_PARE_Msk & ((value) << US_CSR_PARE_Pos))
#define US_CSR_TIMEOUT_Pos                    (8U)                                           /**< (US_CSR) Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) Position */
#define US_CSR_TIMEOUT_Msk                    (0x1U << US_CSR_TIMEOUT_Pos)                   /**< (US_CSR) Receiver Timeout (cleared by writing a one to bit US_CR.STTTO) Mask */
#define US_CSR_TIMEOUT(value)                 (US_CSR_TIMEOUT_Msk & ((value) << US_CSR_TIMEOUT_Pos))
#define US_CSR_TXEMPTY_Pos                    (9U)                                           /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Position */
#define US_CSR_TXEMPTY_Msk                    (0x1U << US_CSR_TXEMPTY_Pos)                   /**< (US_CSR) Transmitter Empty (cleared by writing US_THR) Mask */
#define US_CSR_TXEMPTY(value)                 (US_CSR_TXEMPTY_Msk & ((value) << US_CSR_TXEMPTY_Pos))
#define US_CSR_ITER_Pos                       (10U)                                          /**< (US_CSR) Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) Position */
#define US_CSR_ITER_Msk                       (0x1U << US_CSR_ITER_Pos)                      /**< (US_CSR) Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT) Mask */
#define US_CSR_ITER(value)                    (US_CSR_ITER_Msk & ((value) << US_CSR_ITER_Pos))
#define US_CSR_NACK_Pos                       (13U)                                          /**< (US_CSR) Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) Position */
#define US_CSR_NACK_Msk                       (0x1U << US_CSR_NACK_Pos)                      /**< (US_CSR) Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK) Mask */
#define US_CSR_NACK(value)                    (US_CSR_NACK_Msk & ((value) << US_CSR_NACK_Pos))
#define US_CSR_RIIC_Pos                       (16U)                                          /**< (US_CSR) Ring Indicator Input Change Flag (cleared on read) Position */
#define US_CSR_RIIC_Msk                       (0x1U << US_CSR_RIIC_Pos)                      /**< (US_CSR) Ring Indicator Input Change Flag (cleared on read) Mask */
#define US_CSR_RIIC(value)                    (US_CSR_RIIC_Msk & ((value) << US_CSR_RIIC_Pos))
#define US_CSR_DSRIC_Pos                      (17U)                                          /**< (US_CSR) Data Set Ready Input Change Flag (cleared on read) Position */
#define US_CSR_DSRIC_Msk                      (0x1U << US_CSR_DSRIC_Pos)                     /**< (US_CSR) Data Set Ready Input Change Flag (cleared on read) Mask */
#define US_CSR_DSRIC(value)                   (US_CSR_DSRIC_Msk & ((value) << US_CSR_DSRIC_Pos))
#define US_CSR_DCDIC_Pos                      (18U)                                          /**< (US_CSR) Data Carrier Detect Input Change Flag (cleared on read) Position */
#define US_CSR_DCDIC_Msk                      (0x1U << US_CSR_DCDIC_Pos)                     /**< (US_CSR) Data Carrier Detect Input Change Flag (cleared on read) Mask */
#define US_CSR_DCDIC(value)                   (US_CSR_DCDIC_Msk & ((value) << US_CSR_DCDIC_Pos))
#define US_CSR_CTSIC_Pos                      (19U)                                          /**< (US_CSR) Clear to Send Input Change Flag (cleared on read) Position */
#define US_CSR_CTSIC_Msk                      (0x1U << US_CSR_CTSIC_Pos)                     /**< (US_CSR) Clear to Send Input Change Flag (cleared on read) Mask */
#define US_CSR_CTSIC(value)                   (US_CSR_CTSIC_Msk & ((value) << US_CSR_CTSIC_Pos))
#define US_CSR_RI_Pos                         (20U)                                          /**< (US_CSR) Image of RI Input Position */
#define US_CSR_RI_Msk                         (0x1U << US_CSR_RI_Pos)                        /**< (US_CSR) Image of RI Input Mask */
#define US_CSR_RI(value)                      (US_CSR_RI_Msk & ((value) << US_CSR_RI_Pos))  
#define US_CSR_DSR_Pos                        (21U)                                          /**< (US_CSR) Image of DSR Input Position */
#define US_CSR_DSR_Msk                        (0x1U << US_CSR_DSR_Pos)                       /**< (US_CSR) Image of DSR Input Mask */
#define US_CSR_DSR(value)                     (US_CSR_DSR_Msk & ((value) << US_CSR_DSR_Pos))
#define US_CSR_DCD_Pos                        (22U)                                          /**< (US_CSR) Image of DCD Input Position */
#define US_CSR_DCD_Msk                        (0x1U << US_CSR_DCD_Pos)                       /**< (US_CSR) Image of DCD Input Mask */
#define US_CSR_DCD(value)                     (US_CSR_DCD_Msk & ((value) << US_CSR_DCD_Pos))
#define US_CSR_CTS_Pos                        (23U)                                          /**< (US_CSR) Image of CTS Input Position */
#define US_CSR_CTS_Msk                        (0x1U << US_CSR_CTS_Pos)                       /**< (US_CSR) Image of CTS Input Mask */
#define US_CSR_CTS(value)                     (US_CSR_CTS_Msk & ((value) << US_CSR_CTS_Pos))
#define US_CSR_MANERR_Pos                     (24U)                                          /**< (US_CSR) Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) Position */
#define US_CSR_MANERR_Msk                     (0x1U << US_CSR_MANERR_Pos)                    /**< (US_CSR) Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA) Mask */
#define US_CSR_MANERR(value)                  (US_CSR_MANERR_Msk & ((value) << US_CSR_MANERR_Pos))
#define US_CSR_UNRE_Pos                       (10U)                                          /**< (US_CSR) SPI Underrun Error Position */
#define US_CSR_UNRE_Msk                       (0x1U << US_CSR_UNRE_Pos)                      /**< (US_CSR) SPI Underrun Error Mask */
#define US_CSR_UNRE(value)                    (US_CSR_UNRE_Msk & ((value) << US_CSR_UNRE_Pos))
#define US_CSR_NSSE_Pos                       (19U)                                          /**< (US_CSR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Position */
#define US_CSR_NSSE_Msk                       (0x1U << US_CSR_NSSE_Pos)                      /**< (US_CSR) NSS Line (Driving CTS Pin) Rising or Falling Edge Event Mask */
#define US_CSR_NSSE(value)                    (US_CSR_NSSE_Msk & ((value) << US_CSR_NSSE_Pos))
#define US_CSR_NSS_Pos                        (23U)                                          /**< (US_CSR) Image of NSS Line Position */
#define US_CSR_NSS_Msk                        (0x1U << US_CSR_NSS_Pos)                       /**< (US_CSR) Image of NSS Line Mask */
#define US_CSR_NSS(value)                     (US_CSR_NSS_Msk & ((value) << US_CSR_NSS_Pos))
#define US_CSR_LINBK_Pos                      (13U)                                          /**< (US_CSR) LIN Break Sent or LIN Break Received Position */
#define US_CSR_LINBK_Msk                      (0x1U << US_CSR_LINBK_Pos)                     /**< (US_CSR) LIN Break Sent or LIN Break Received Mask */
#define US_CSR_LINBK(value)                   (US_CSR_LINBK_Msk & ((value) << US_CSR_LINBK_Pos))
#define US_CSR_LINID_Pos                      (14U)                                          /**< (US_CSR) LIN Identifier Sent or LIN Identifier Received Position */
#define US_CSR_LINID_Msk                      (0x1U << US_CSR_LINID_Pos)                     /**< (US_CSR) LIN Identifier Sent or LIN Identifier Received Mask */
#define US_CSR_LINID(value)                   (US_CSR_LINID_Msk & ((value) << US_CSR_LINID_Pos))
#define US_CSR_LINTC_Pos                      (15U)                                          /**< (US_CSR) LIN Transfer Completed Position */
#define US_CSR_LINTC_Msk                      (0x1U << US_CSR_LINTC_Pos)                     /**< (US_CSR) LIN Transfer Completed Mask */
#define US_CSR_LINTC(value)                   (US_CSR_LINTC_Msk & ((value) << US_CSR_LINTC_Pos))
#define US_CSR_LINBLS_Pos                     (23U)                                          /**< (US_CSR) LIN Bus Line Status Position */
#define US_CSR_LINBLS_Msk                     (0x1U << US_CSR_LINBLS_Pos)                    /**< (US_CSR) LIN Bus Line Status Mask */
#define US_CSR_LINBLS(value)                  (US_CSR_LINBLS_Msk & ((value) << US_CSR_LINBLS_Pos))
#define US_CSR_LINBE_Pos                      (25U)                                          /**< (US_CSR) LIN Bus Error Position */
#define US_CSR_LINBE_Msk                      (0x1U << US_CSR_LINBE_Pos)                     /**< (US_CSR) LIN Bus Error Mask */
#define US_CSR_LINBE(value)                   (US_CSR_LINBE_Msk & ((value) << US_CSR_LINBE_Pos))
#define US_CSR_LINISFE_Pos                    (26U)                                          /**< (US_CSR) LIN Inconsistent Synch Field Error Position */
#define US_CSR_LINISFE_Msk                    (0x1U << US_CSR_LINISFE_Pos)                   /**< (US_CSR) LIN Inconsistent Synch Field Error Mask */
#define US_CSR_LINISFE(value)                 (US_CSR_LINISFE_Msk & ((value) << US_CSR_LINISFE_Pos))
#define US_CSR_LINIPE_Pos                     (27U)                                          /**< (US_CSR) LIN Identifier Parity Error Position */
#define US_CSR_LINIPE_Msk                     (0x1U << US_CSR_LINIPE_Pos)                    /**< (US_CSR) LIN Identifier Parity Error Mask */
#define US_CSR_LINIPE(value)                  (US_CSR_LINIPE_Msk & ((value) << US_CSR_LINIPE_Pos))
#define US_CSR_LINCE_Pos                      (28U)                                          /**< (US_CSR) LIN Checksum Error Position */
#define US_CSR_LINCE_Msk                      (0x1U << US_CSR_LINCE_Pos)                     /**< (US_CSR) LIN Checksum Error Mask */
#define US_CSR_LINCE(value)                   (US_CSR_LINCE_Msk & ((value) << US_CSR_LINCE_Pos))
#define US_CSR_LINSNRE_Pos                    (29U)                                          /**< (US_CSR) LIN Slave Not Responding Error Interrupt Mask Position */
#define US_CSR_LINSNRE_Msk                    (0x1U << US_CSR_LINSNRE_Pos)                   /**< (US_CSR) LIN Slave Not Responding Error Interrupt Mask Mask */
#define US_CSR_LINSNRE(value)                 (US_CSR_LINSNRE_Msk & ((value) << US_CSR_LINSNRE_Pos))
#define US_CSR_LINSTE_Pos                     (30U)                                          /**< (US_CSR) LIN Synch Tolerance Error Position */
#define US_CSR_LINSTE_Msk                     (0x1U << US_CSR_LINSTE_Pos)                    /**< (US_CSR) LIN Synch Tolerance Error Mask */
#define US_CSR_LINSTE(value)                  (US_CSR_LINSTE_Msk & ((value) << US_CSR_LINSTE_Pos))
#define US_CSR_LINHTE_Pos                     (31U)                                          /**< (US_CSR) LIN Header Timeout Error Position */
#define US_CSR_LINHTE_Msk                     (0x1U << US_CSR_LINHTE_Pos)                    /**< (US_CSR) LIN Header Timeout Error Mask */
#define US_CSR_LINHTE(value)                  (US_CSR_LINHTE_Msk & ((value) << US_CSR_LINHTE_Pos))
#define US_CSR_LSFE_Pos                       (6U)                                           /**< (US_CSR) LON Short Frame Error Position */
#define US_CSR_LSFE_Msk                       (0x1U << US_CSR_LSFE_Pos)                      /**< (US_CSR) LON Short Frame Error Mask */
#define US_CSR_LSFE(value)                    (US_CSR_LSFE_Msk & ((value) << US_CSR_LSFE_Pos))
#define US_CSR_LCRCE_Pos                      (7U)                                           /**< (US_CSR) LON CRC Error Position */
#define US_CSR_LCRCE_Msk                      (0x1U << US_CSR_LCRCE_Pos)                     /**< (US_CSR) LON CRC Error Mask */
#define US_CSR_LCRCE(value)                   (US_CSR_LCRCE_Msk & ((value) << US_CSR_LCRCE_Pos))
#define US_CSR_LTXD_Pos                       (24U)                                          /**< (US_CSR) LON Transmission End Flag Position */
#define US_CSR_LTXD_Msk                       (0x1U << US_CSR_LTXD_Pos)                      /**< (US_CSR) LON Transmission End Flag Mask */
#define US_CSR_LTXD(value)                    (US_CSR_LTXD_Msk & ((value) << US_CSR_LTXD_Pos))
#define US_CSR_LCOL_Pos                       (25U)                                          /**< (US_CSR) LON Collision Detected Flag Position */
#define US_CSR_LCOL_Msk                       (0x1U << US_CSR_LCOL_Pos)                      /**< (US_CSR) LON Collision Detected Flag Mask */
#define US_CSR_LCOL(value)                    (US_CSR_LCOL_Msk & ((value) << US_CSR_LCOL_Pos))
#define US_CSR_LFET_Pos                       (26U)                                          /**< (US_CSR) LON Frame Early Termination Position */
#define US_CSR_LFET_Msk                       (0x1U << US_CSR_LFET_Pos)                      /**< (US_CSR) LON Frame Early Termination Mask */
#define US_CSR_LFET(value)                    (US_CSR_LFET_Msk & ((value) << US_CSR_LFET_Pos))
#define US_CSR_LRXD_Pos                       (27U)                                          /**< (US_CSR) LON Reception End Flag Position */
#define US_CSR_LRXD_Msk                       (0x1U << US_CSR_LRXD_Pos)                      /**< (US_CSR) LON Reception End Flag Mask */
#define US_CSR_LRXD(value)                    (US_CSR_LRXD_Msk & ((value) << US_CSR_LRXD_Pos))
#define US_CSR_LBLOVFE_Pos                    (28U)                                          /**< (US_CSR) LON Backlog Overflow Error Position */
#define US_CSR_LBLOVFE_Msk                    (0x1U << US_CSR_LBLOVFE_Pos)                   /**< (US_CSR) LON Backlog Overflow Error Mask */
#define US_CSR_LBLOVFE(value)                 (US_CSR_LBLOVFE_Msk & ((value) << US_CSR_LBLOVFE_Pos))
#define US_CSR_Msk                            (0xFFFFE7E7UL)                                 /**< (US_CSR) Register Mask  */

